
                            PrimeTime (R)
             Version G-2012.06 for RHEL64 -- May 23, 2012
                Copyright (c) 1988-2012 Synopsys, Inc.
                         ALL RIGHTS RESERVED

This program is proprietary and confidential information of Synopsys, Inc.
and may be used and disclosed only as authorized in a license agreement
controlling such use and disclosure.

#################################################################################
# PrimeTime Reference Methodology Script
# Script: pt.tcl
# Version: D-2010.06 (July 6, 2010)
# Copyright (C) 2008-2010 Synopsys All rights reserved.
################################################################################
##################################################################
#    Source common and pt_setup.tcl File                         #
##################################################################
source make_generated_vars.tcl
vcdplus
source common_setup.tcl
VDD
source pt_setup.tcl
set REPORTS_SUFFIX $PT_METHOD.$PT_PARASITIC
avg.max
##################################################################
#    Search Path, Library and Operating Condition Section        #
##################################################################
# Under normal circumstances, when executing a script with source, Tcl
# errors (syntax and semantic) cause the execution of the script to terminate.
# Uncomment the following line to set sh_continue_on_error to true to allow
# processing to continue when errors occur.
#set sh_continue_on_error true
set power_enable_analysis true
true
set power_analysis_mode averaged
averaged
set report_default_significant_digits 4 ;
4
set sh_source_uses_search_path true ;
true
set search_path ". $search_path" ;
. . /home/ff/ee241/stdcells/synopsys-32nm/multi_vt/db  ../../icc-par/current-icc/results ../../../../ref 
##################################################################
#    Netlist Reading Section                                     #
##################################################################
set link_path "* $link_path"
* * saed32rvt_tt1p05v25c.db   
read_verilog $NETLIST_FILES
Loading verilog file '/home/cc/cs199/fa13/class/cs199-cwb/ee241b/interp_filt_analysis/build-rvt/icc-par/current-icc/results/interp_filt.output.v'
1
current_design $DESIGN_NAME
{"interp_filt"}
link
Loading db file '/home/ff/ee241/stdcells/synopsys-32nm/multi_vt/db/saed32rvt_tt1p05v25c.db'
Linking design interp_filt...
Information: 292 (99.32%) library cells are unused in library saed32rvt_tt1p05v25c.....
Information: total 292 library cells are unused.
Design 'interp_filt' was successfully linked.
1
##################################################################
#    Power Switching Activity Annotation Section                 #
##################################################################
read_saif $ACTIVITY_FILE -strip_path $STRIP_PATH
Information: Checked out license 'PrimeTime-PX' (PT-019)

======================================================================
Summary:
Total number of nets = 25
Number of annotated nets = 25 (100.00%)
Total number of leaf cells = 20
Number of fully annotated leaf cells = 20 (100.00%)
======================================================================

1
report_switching_activity -list_not_annotated > $REPORTS_DIR/$PT_EXEC.switching.$REPORTS_SUFFIX.report
##################################################################
#    Back Annotation Section                                     #
##################################################################
if {[info exists PARASITIC_PATHS] && [info exists PARASITIC_FILES]} {
  foreach para_path $PARASITIC_PATHS para_file $PARASITIC_FILES {
    if {[string compare $para_path $DESIGN_NAME] == 0} {
      read_parasitics -increment -format sbpf $para_file
    } else {
      read_parasitics -path $para_path -increment -format sbpf $para_file
    }
  }
  report_annotated_parasitics -check > $REPORTS_DIR/$PT_EXEC.rap.$REPORTS_SUFFIX.report
}
Information: Log for parasitic commands will be generated in 'parasitics_command.log'. (PARA-107)
##################################################################
#    Reading Constraints Section                                 #
##################################################################
if {[info exists CONSTRAINT_FILES]} {
  foreach constraint_file $CONSTRAINT_FILES {
    if {[file extension $constraint_file] eq ".sdc"} {
      read_sdc -echo $constraint_file -version 1.7
    } else {
      source -echo $constraint_file
    }
  }
}

Reading SDC version 1.7...
###################################################################
# Created by write_sdc on Wed Feb 28 09:00:37 2018
###################################################################
set sdc_version 1.7
set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_driving_cell -lib_cell INVX1_RVT [get_ports {A[3]}]
Information: Loading library data due to accessing lib cells not linked in the current design. (LNK-041)
set_driving_cell -lib_cell INVX1_RVT [get_ports {A[2]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {A[1]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {A[0]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports clk]
set_load -pin_load 0.01 [get_ports {Z[15]}]
set_load -pin_load 0.01 [get_ports {Z[14]}]
set_load -pin_load 0.01 [get_ports {Z[13]}]
set_load -pin_load 0.01 [get_ports {Z[12]}]
set_load -pin_load 0.01 [get_ports {Z[11]}]
set_load -pin_load 0.01 [get_ports {Z[10]}]
set_load -pin_load 0.01 [get_ports {Z[9]}]
set_load -pin_load 0.01 [get_ports {Z[8]}]
set_load -pin_load 0.01 [get_ports {Z[7]}]
set_load -pin_load 0.01 [get_ports {Z[6]}]
set_load -pin_load 0.01 [get_ports {Z[5]}]
set_load -pin_load 0.01 [get_ports {Z[4]}]
set_load -pin_load 0.01 [get_ports {Z[3]}]
set_load -pin_load 0.01 [get_ports {Z[2]}]
set_load -pin_load 0.01 [get_ports {Z[1]}]
set_load -pin_load 0.01 [get_ports {Z[0]}]
create_clock [get_ports clk]  -name ideal_clock1  -period 0.18  -waveform {0 0.09}
group_path -name FEEDTHROUGH  -from [list [get_ports {A[3]}] [get_ports {A[2]}] [get_ports {A[1]}]          [get_ports {A[0]}]]  -to [list [get_ports {Z[15]}] [get_ports {Z[14]}] [get_ports {Z[13]}]         [get_ports {Z[12]}] [get_ports {Z[11]}] [get_ports {Z[10]}] [get_ports {Z[9]}] [get_ports {Z[8]}] [get_ports {Z[7]}] [get_ports {Z[6]}] [get_ports {Z[5]}]    [get_ports {Z[4]}] [get_ports {Z[3]}] [get_ports {Z[2]}] [get_ports {Z[1]}]    [get_ports {Z[0]}]]
group_path -name REGIN  -from [list [get_ports {A[3]}] [get_ports {A[2]}] [get_ports {A[1]}]          [get_ports {A[0]}]]
group_path -name REGOUT  -to [list [get_ports {Z[15]}] [get_ports {Z[14]}] [get_ports {Z[13]}]         [get_ports {Z[12]}] [get_ports {Z[11]}] [get_ports {Z[10]}] [get_ports {Z[9]}] [get_ports {Z[8]}] [get_ports {Z[7]}] [get_ports {Z[6]}] [get_ports {Z[5]}]    [get_ports {Z[4]}] [get_ports {Z[3]}] [get_ports {Z[2]}] [get_ports {Z[1]}]    [get_ports {Z[0]}]]
set_input_delay -clock ideal_clock1  0  [get_ports clk]
Error: Setting input delay on clock port ('clk') relative to a clock (ideal_clock1) defined at the same port. Command is ignored. (UITE-489)
set_input_delay -clock ideal_clock1  0  [get_ports {A[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {A[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {A[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {A[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[15]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[14]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[13]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[12]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[11]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[10]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[9]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[8]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Z[0]}]
set_timing_derate -late -net_delay  1.01 
set_timing_derate -early -net_delay  0.99 
set_timing_derate -late -cell_delay 1.01 
set_timing_derate -early -cell_delay 0.99 
##################################################################
#    Clock Tree Synthesis Section                                #
##################################################################
#set_propagated_clock [all_clocks]
##################################################################
#    Update_timing and check_timing Section                      #
##################################################################
update_timing -full
Information: Using automatic max wire load selection group 'predcaps'. (ENV-003)
Information: Using automatic min wire load selection group 'predcaps'. (ENV-003)
1
# Ensure design is properly constrained
check_timing -verbose > $REPORTS_DIR/$PT_EXEC.ct.$REPORTS_SUFFIX.report
##################################################################
#    Report_timing Section                                       #
##################################################################
report_timing -slack_lesser_than 0.0 -delay min_max -nosplit -input -net -sign 4 > $REPORTS_DIR/$PT_EXEC.timing.$REPORTS_SUFFIX.report
report_clock -skew -attribute > $REPORTS_DIR/$PT_EXEC.clock.$REPORTS_SUFFIX.report
report_analysis_coverage > $REPORTS_DIR/$PT_EXEC.converage.$REPORTS_SUFFIX.report
##################################################################
#    Power Analysis Section                                      #
##################################################################
## run power analysis
check_power > $REPORTS_DIR/$PT_EXEC.checkpower.$REPORTS_SUFFIX.report
update_power
Information: Running averaged power analysis... (PWR-601)
1
## report_power
report_power -nosplit -verbose -hierarchy > $REPORTS_DIR/$PT_EXEC.power.$REPORTS_SUFFIX.report
exit
Information: Defining new variable 'PT_PARASITIC'. (CMD-041)
Information: Defining new variable 'LIBRARY_DONT_USE_FILE'. (CMD-041)
Information: Defining new variable 'ADDITIONAL_SEARCH_PATH'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET'. (CMD-041)
Information: Defining new variable 'PT_EXEC'. (CMD-041)
Information: Defining new variable 'REPORTS_DIR'. (CMD-041)
Information: Defining new variable 'MW_POWER_PORT1'. (CMD-041)
Information: Defining new variable 'MW_POWER_PORT2'. (CMD-041)
Information: Defining new variable 'MW_POWER_PORT3'. (CMD-041)
Information: Defining new variable 'MW_POWER_PORT4'. (CMD-041)
Information: Defining new variable 'VA3_COORDINATES'. (CMD-041)
Information: Defining new variable 'PT_METHOD'. (CMD-041)
Information: Defining new variable 'MW_GROUND_PORT'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET1'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET2'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET3'. (CMD-041)
Information: Defining new variable 'HIERARCHICAL_CELLS'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET4'. (CMD-041)
Information: Defining new variable 'MIN_LIBRARY_FILES'. (CMD-041)
Information: Defining new variable 'para_path'. (CMD-041)
Information: Defining new variable 'VA4_COORDINATES'. (CMD-041)
Information: Defining new variable 'MIN_ROUTING_LAYER'. (CMD-041)
Information: Defining new variable 'MW_REFERENCE_LIB_DIRS'. (CMD-041)
Information: Defining new variable 'MW_POWER_PORT'. (CMD-041)
Information: Defining new variable 'ADDITIONAL_LINK_LIB_FILES'. (CMD-041)
Information: Defining new variable 'PARASITIC_FILES'. (CMD-041)
Information: Defining new variable 'PARASITIC_PATHS'. (CMD-041)
Information: Defining new variable 'ACTIVITY_FILE'. (CMD-041)
Information: Defining new variable 'TARGET_LIBRARY_FILES'. (CMD-041)
Information: Defining new variable 'DESIGN_NAME'. (CMD-041)
Information: Defining new variable 'MW_GROUND_NET'. (CMD-041)
Information: Defining new variable 'DESIGN_REF_DATA_PATH'. (CMD-041)
Information: Defining new variable 'PD4_CELLS'. (CMD-041)
Information: Defining new variable 'NETLIST_FILES'. (CMD-041)
Information: Defining new variable 'PD3_CELLS'. (CMD-041)
Information: Defining new variable 'PD2_CELLS'. (CMD-041)
Information: Defining new variable 'VA1_COORDINATES'. (CMD-041)
Information: Defining new variable 'PD1_CELLS'. (CMD-041)
Information: Defining new variable 'constraint_file'. (CMD-041)
Information: Defining new variable 'para_file'. (CMD-041)
Information: Defining new variable 'CONSTRAINT_FILES'. (CMD-041)
Information: Defining new variable 'STRIP_PATH'. (CMD-041)
Information: Defining new variable 'MAX_ROUTING_LAYER'. (CMD-041)
Information: Defining new variable 'MW_REFERENCE_CONTROL_FILE'. (CMD-041)
Information: Defining new variable 'HIERARCHICAL_DESIGNS'. (CMD-041)
Information: Defining new variable 'VA2_COORDINATES'. (CMD-041)
Information: Defining new variable 'NAME_MAP_FILE'. (CMD-041)
Information: Defining new variable 'REPORTS_SUFFIX'. (CMD-041)
Information: Defining new variable 'PD1'. (CMD-041)
Information: Defining new variable 'PD2'. (CMD-041)
Information: Defining new variable 'PD3'. (CMD-041)
Information: Defining new variable 'PD4'. (CMD-041)
Updating preference file: /home/cc/cs199/fa13/class/cs199-cwb/.synopsys_pt_prefs.tcl

Timing updates: 1 (0 implicit, 1 explicit) (0 incremental, 1 full)
Noise updates: 0 (0 implicit, 0 explicit) (0 incremental, 0 full)
Maximum memory usage for this session: 185.46 MB
CPU usage for this session: 1 seconds 
Elapsed time for this session: 2 seconds
Diagnostics summary: 1 error, 58 informationals

Thank you for using pt_shell!
